RIET/src/Documents/Tickets/Tickets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Tickets</name>
  <registerRecords>AccumulationRegister.Тикеты</registerRecords>
  <attributes>
    <name>Статус</name>
    <comment>1437</comment>
    <type>
      <types>EnumRef.TicketsStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>TicketNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Oilfield</name>
    <type>
      <types>CatalogRef.Oilfields</types>
    </type>
  </attributes>
  <attributes>
    <name>Well</name>
    <type>
      <types>CatalogRef.Wells</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductLine</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>GeoMarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountingUnit</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>SiebelOrder</name>
    <type>
      <types>DocumentRef.SiebelOrders</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаWS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетWS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаPM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетPM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаRech</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетRech</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыТикетов</types>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Invoices</name>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Group</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Lawson</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаWS</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаPM</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаRech</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Enums/ТипыТикетов/ТипыТикетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТикетов</name>
  <enumValues>
    <name>КредитНота</name>
    <comment>Кредит-нота</comment>
  </enumValues>
  <enumValues>
    <name>Инвойс</name>
    <comment>Инвойс</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ВидыОперацийРеализацияТоваров/ВидыОперацийРеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРеализацияТоваров</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПродажаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>КредитНотаСторно</name>
  </enumValues>
  <enumValues>
    <name>КредитНотаОтрицатСФ</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяКредитНота</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>РеализацияАгент</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/Tickets/Forms/ФормаНастройкиРеализации/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Ticket") Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Ticket = Параметры.Ticket;
	TicketОбъект = Ticket.ПолучитьОбъект();
	
	Если TicketОбъект.Тип = "Credit note" ИЛИ TicketОбъект.Тип = "Кредит-нота" 
		ИЛИ TicketОбъект.Тип = Перечисления.ТипыТикетов.КредитНота Тогда
		
		Элементы.ВидОперации.РежимВыбораИзСписка = Истина;
		МассивВидовОперации = Новый Массив;
		МассивВидовОперации.Добавить(Перечисления.ВидыОперацийРеализацияТоваров.КредитНотаОтрицатСФ);
		МассивВидовОперации.Добавить(Перечисления.ВидыОперацийРеализацияТоваров.КредитНотаСторно);
		Элементы.ВидОперации.СписокВыбора.ЗагрузитьЗначения(МассивВидовОперации);
		
	иначе 
		
		ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
		
	КонецЕсли;
	
	ДоговорИзTicket = TicketОбъект.ДоговорКонтрагента;
	КонтрагентИзTicket = TicketОбъект.Контрагент;
	
	ВалютаИзTicket = ?(ЗначениеЗаполнено(TicketОбъект.Валюта), TicketОбъект.Валюта, TicketОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	Валюта = ВалютаИзTicket;
	Если ВалютаИзTicket = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		Элементы.Валюта.Видимость = Ложь;
		Элементы.КурсВзаиморасчетов.Видимость = Ложь;
	иначе
		МассивВалют = Новый Массив;	
		МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("643"));
		МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("840"));
		Элементы.Валюта.СписокВыбора.ЗагрузитьЗначения(МассивВалют);
	КонецЕсли;
       	        	
	КурсВзаиморасчетов = ДоговорИзTicket.Курс;
	КратностьВзаиморасчетов = 1;
	
	Если КурсВзаиморасчетов = 0 Тогда
		СтруктураНовогоКурсаВалюты  = ОбщегоНазначения.ПолучитьКурсВалюты(Валюта, TicketОбъект.Дата);
		КурсВзаиморасчетов      = СтруктураНовогоКурсаВалюты.Курс;
		КратностьВзаиморасчетов = СтруктураНовогоКурсаВалюты.Кратность;
	КонецЕсли;
	
	СуммаТикета = SalesBook.ПолучитьОстатокПоТикету(, Ticket);
	ПриИзмененииВидаОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ПриИзмененииВидаОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаОперации()
	
	Если ВидОперации <> Перечисления.ВидыОперацийРеализацияТоваров.КредитНотаСторно Тогда
		Элементы.ТипРеализации.Доступность = Истина;
		ТипРеализации = 1;
	иначе
		Элементы.ТипРеализации.Доступность = Ложь;
		ТипРеализации = 0;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.КредитНотаСторно Тогда 
		Элементы.Сделка.Доступность = Истина;
	иначе 
		Элементы.Сделка.Доступность = Ложь;
		Сделка = Неопределено;
	КонецЕсли;
	
	Если НЕ (ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ВнутренняяКредитНота
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.КредитНотаСторно) Тогда
		Элементы.Валюта.Доступность = Истина;
		Элементы.КурсВзаиморасчетов.Доступность = Истина;
	иначе
		Элементы.Валюта.Доступность = Ложь;
		Элементы.КурсВзаиморасчетов.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров  = Новый Структура("НастроитьДляВыбораСделкиКредитНотаСторно,Договор,Контрагент",
												, ДоговорИзTicket, КонтрагентИзTicket);

	Сделка = ОткрытьФормуМодально("Документ.РеализацияТоваровУслуг.ФормаВыбора", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура("ТипРеализации");
	СтруктураНастройки.Вставить("ВидОперации", ВидОперации);
	
	Если ТипРеализации = 1 Тогда 
		СтруктураНастройки.Вставить("ТипРеализации", "Товары");
	ИначеЕсли ТипРеализации = 2 Тогда
		СтруктураНастройки.Вставить("ТипРеализации", "Услуги");
	КонецЕсли;
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.КредитНотаСторно")
		И Не ЗначениеЗаполнено(Сделка) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Заполните поле Сделка!"
			,,"Сделка");
		Возврат;
 	КонецЕсли;
	СтруктураНастройки.Вставить("Сделка", Сделка);
	
	СтруктураНастройки.Вставить("ВалютаДокумента", Валюта);
	СтруктураНастройки.Вставить("КурсВзаиморасчетов", КурсВзаиморасчетов);
	СтруктураНастройки.Вставить("КратностьВзаиморасчетов", КратностьВзаиморасчетов);
    СтруктураНастройки.Вставить("СуммаТикета", СуммаТикета);
	СтруктураНастройки.Вставить("Ticket", Ticket);
	
	ЭтаФорма.Закрыть(СтруктураНастройки);
	
КонецПроцедуры
